Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartMaterialDiff
Part material difference.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartMaterialDiff.#ctor(Tekla.Structures.Identifier,System.Int32,System.String,System.String)
Initializes a new instance of the Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartMaterialDiff class.
id: The object identifier.
posIndex: The position index.
physicalMaterial: The physical material.
analysisMaterial: The analysis material.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartMaterialDiff.PosIndex
Gets the position index.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartMaterialDiff.PhysicalMaterial
Gets the physical material.

Tekla.Structures.AnalysisInternal.AnalysisChangeManagement.PartMaterialDiff.AnalysisMaterial
Gets the analysis material.